merge lexdivIncrease branch in dev
